# -*- encoding: utf-8 -*-
=begin
= ID予約

=end

#==============================================================================
# ■ NWConst::Sw
#==============================================================================
module NWConst::Sw
  # 自動メッセージ利用フラグとして扱うスイッチ（素材：メッセージ制御文字拡張で使用）
  AUTO_MESSAGE = 2
  # 仲間加入拒否スイッチ (FOLLOWER_DISABLE_2と同じ)
  FOLLOWER_DISABLE_1 = 3
  # ニューゲーム時とロード時にオンにするスイッチ
  ON_GAME_START = 24
  # オンの時、<エンカウント半減/無効>の無効化およびスキル/アイテム効果「逃げる」の無効化
  STRICT_ENCOUNT = 52
  # 上級職・上級種の解放スイッチ
  OPEN_CLASS_LANK2 = 90
  # 最上級職・最上級種の解放スイッチ
  OPEN_CLASS_LANK3 = 91
  # 封印職・封印種の解放スイッチ
  OPEN_CLASS_LANK4 = 92
  # 禁職の解放スイッチ
  OPEN_CLASS_LANK5 = 444
  # アクセサリースロットを拡張するスイッチID
  EXTRA_ACCESSORY_SLOT = 445
  # 捕食シーンカットスイッチ
  CUT_PREDATION = 95
  # 全滅不能スイッチ
  ALL_DEAD_DISABLE = 96
  # 戦闘勝利時の経験値とドロップアイテム 入手不能スイッチ
  GET_DISABLE_EXP_DROP = 97
  # 簡易ステータスを表示するスイッチ
  SIMPLE_STATUS = 98
  # 擬似敗北イベント中フラグ
  LOSE_EVENT = 99  
  # ワープ禁止スイッチID
  WARP_BAN = 100
  # メニュー画面に秘石変更画面へ移動する選択肢を追加するスイッチID
  MENU_ENCHANT_STONE = 7091
  # ワープ開放フラグのベース値
  # 実際にアクセスするのはベース値+NWConst::Warp::Placesのインデックス値になります
  WARP_OPEN_BASE = 5001
  # 図鑑用地名スイッチ番号ベース値
  # 実際にアクセスするのはベース値+PLACEのインデックス値
  PLACE_FLAG_BASE = 5201    
  # 仲間になったアクターIDを格納するベース値
  # 実際にアクセスするのはベース値+アクターID
  ADD_ACTOR_BASE = 1000
  
  # 戦闘中の「入れ替え」コマンドを禁止するスイッチ
  FORBID_BATTLE_SHIFT_CHANGE = 27
  # 仲間加入拒否スイッチID (FOLLOWER_DISABLE_1と同じ)
  FOLLOWER_DISABLE_2 = 81
  # 戦闘勝利時の経験値 入手不能スイッチ
  GET_DISABLE_EXP = 82
  # 戦闘勝利時のお金 入手不能スイッチ
  GET_DISABLE_GOLD = 83
  # 戦闘勝利時のドロップアイテム 入手不能スイッチ
  GET_DISABLE_DROP = 84
  # 盗み強制失敗スイッチ
  STEAL_FAIL = 85

  # Hシーン図鑑の全項目解放フラグに利用するスイッチID
  LIBRARY_H_OPEN = 442
  # Hシーン図鑑の回想イベント中にオンになるスイッチ
  LIBRARY_H_MEMORY = 443

end

#==============================================================================
# ■ NWConst::Var
#==============================================================================
module NWConst::Var
  # 自動ポップ表示位置の設定を行う変数の番号(変数の値 :-2=表示オフ,-1=プレイヤー,0=現在イベント,1以上=イベントID)
  ICON_POPUP_TARGET = 3
  # この変数の値が1以上なら、特定イベントコマンド(トリス修正Q参照)の敵番号をその値に強制変換
  EVENT_ENEMY_ID = 112
  # 敵のパラメーター補正を与える変数
  PARAM1 = 41 # MHP
  PARAM2 = 42 # ATK, MAG, DEX
  PARAM3 = 43 # DEF, MDF
  PARAM4 = 44 # AGI
  PARAM_STATE_RATE = {
    # ステート有効度  敵のステート有効度に [変数の値]% を乗算する
    # ただし変数の値が0なら100%（変化なし）、マイナスなら0%とする
    #   ステートID => 変数ID,
    230 => 45,
    231 => 45,
    232 => 45,
  }
  # 戦闘後終了時に上がる好感度を格納する変数の番号
  BATTLE_END_GAIN_LOVE = 52  
  # スキル使用者のIDを格納する変数の番号
  ACTION_USER = 100
  # スキル対象者のIDを格納する変数の番号
  ACTION_TARGET = 101
  # 現在の歩数を格納する変数の番号
  STEPS = 102
  # 現在の所持金を格納する変数の番号
  GOLD = 103
  # 使用スキルIDを格納する変数の番号
  USED_SKILL_ID = 104
  # スキルの成否判定を格納する変数の番号
  ACTION_HIT = 105
  # スキル対象者の友好度を格納する変数の番号
  ACTION_TARGET_FRIEND = 106  
  # 立ち上がったエネミーのIDを格納する変数の番号
  GET_UP = 107
  # スキル使用者のベースレベルを格納する変数の番号
  ACTION_USER_LEVEL = 108
  # スキル対象者の逃走レベルを格納する変数の番号
  ACTION_TARGET_LEVEL = 109  
  # 現在の所持コインを格納する変数の番号
  COIN = 110
  # 最後に行われた戦闘の勝利するまでの経過ターン数を保存する変数の番号
  BATTLE_END_TURN = 111
  # 敗北イベントが呼び出されるエネミーのIDを格納する変数の番号
  LOSE_EVENT_ENEMY_ID = 113
  # イベントコマンド「数値入力の処理」の桁数を指定する変数の番号(変数の値が0以下の場合はイベントで設定された値を利用する。「数値入力の処理」が行われる度に変数の値は0になる)
  NUM_INPUT_DIGIT = 114
  # 周回数を格納する変数の番号
  TRACK = 912
  # 現在の難易度を格納する変数の番号
  CURRENT_DIFFICULTY = 902
  # クリア時の最高難易度を格納する変数の番号
  CLEAR_DIFFICULTY = 903
  # バトルファッカー撃破数を格納する変数の番号
  BATTLEFUCKER_DEFEAT = 907
  # エネミー用友好度を格納する変数の番号ベース値
  # 実際にアクセスするのはベース値+エネミーID
  ENEMY_REL_BASE = 2000
  # アクター用好感度を格納する変数の番号ベース値
  # 実際にアクセスするのはベース値+アクターID
  ACTOR_REL_BASE = 3000
  # 共有変数IDの設定  友好度共有に使う  []内に共有したいIDを指定
  COMMON_VARIABLE = [
    [2002, 2003],
    [2009, 2910],
    [2010, 2911],
    [2011, 2912],
    [2012, 2880],
    [2015, 2952],
    [2022, 2961],
    [2051, 2542, 2939],
    [2078, 2079, 2080, 2081],
    [2087, 2088, 2089, 2090, 2091, 2092],
    [2094, 2524, 2588, 2588, 2830],
    [2110, 2543, 2940],
    [2120, 2914],
    [2143, 2845],
    [2144, 2823],
    [2145, 2150],
    [2146, 2559],
    [2147, 2562],
    [2158, 2159, 2160],
    [2168, 2169],
    [2177, 2385],
    [2178, 2286, 2536],
    [2184, 2915],
    [2197, 2198, 2199],
    [2200, 2201, 2202],
    [2206, 2207],
    [2208, 2209, 2210, 2211],
    [2216, 2217, 2218],
    [2223, 2539],
    [2224, 2538, 2605, 2606, 2607],
    [2227, 2228, 2229, 2230],
    [2232, 2505, 2506, 2535, 2810, 2811],
    [2241, 2242, 2243],
    [2255, 2809, 2941],
    [2268, 2269, 2270, 2271],
    [2295, 2917],
    [2297, 2498, 916],
    [2298, 2918],
    [2312, 2313],
    [2315, 2632],
    [2321, 2322, 2323],
    [2331, 2919],
    [2332, 2920],
    [2333, 2921],
    [2345, 2531],
    [2346, 2532],
    [2347, 2533],
    [2348, 2349, 2350, 2648, 2797],
    [2353, 2354, 2355, 2356, 2357],
    [2358, 2359, 2360],
    [2365, 2667],
    [2368, 2369, 2370, 2805, 2806],
    [2384, 2731],
    [2515, 2516, 2517],
    [2514, 2636],
    [2523, 2641],
    [2534, 2728],
    [2537, 2690],
    [2545, 2546, 2547],
    [2560, 2566],
    [2570, 2571],
    [2582, 2614, 2655],
    [2583, 2658],
    [2612, 2676],
    [2615, 2660],
    [2624, 2625, 2886],
    [2687, 2688, 2689],
    [2696, 2777, 2924, 2925, 2926],
    [2702, 2819],
    [2705, 2995],
    [2711, 2712, 2905, 2996],
    [2722, 2821],
    [2723, 2822],
    [2734, 2820],
    [2740, 2741],
    [2744, 2815],
    [2752, 2900],
    [2753, 2754],
    [2755, 2756],
    [2758, 2898],
    [2764, 2899],
    [2766, 2897],
    [2769, 2795],
    [2779, 2784, 2856, 2906, 2994],
    [2780, 2816],
    [2798, 2799, 2800, 2963, 2965],
    [2801, 2802, 2803, 2964, 2966],
    [2825, 2826, 2827],
    [2835, 2836, 2837],
    [2842, 2858, 2859, 2971],
    [2846, 2967],
    [2847, 2892],
    [2850, 2871],
    [2854, 2934],
    [2855, 2945],
    [2860, 2861, 2893],
    [2865, 2944],
    [2866, 2945],
    [2867, 2933],
    [2868, 2977],
    [2869, 2981],
    [2870, 2923],
    [2887, 2891],
    [2942, 2943],
    [2954, 2955],
    [2968, 2984],
    [2969, 2970],
    [2972, 2983],
    [2974, 2975],
    [2982, 2998],
    [2991, 2992, 2993],

  ]
  # 拡張選択肢の結果を保存する変数の番号
  EX_CHOICE_RESULT = 9
  # 混沌の迷宮の到達階層を保存する変数の番号 値が1以上なら「今回の冒険」に表示
  EX_DUNGEON_REACH = 122
  # パーティ人数上限に加算する値を代入する変数の番号
  PARTY_MAX_PLUS = 56
  # エンチャント武器の個数を取得する変数の番号
  ENCHANT_WEAPON_ITEM_NUMBER =200
  # エンチャント防具の個数を取得する変数の番号
  ENCHANT_ARMOR_ITEM_NUMBER = 201

  #エンチャントのレア度を指定する変数
  ENCHANT_RARELITY_ID = 150

  # マップ移動時にこの変数の値が1以上なら、変数の値のマップIDへ移動する
  MAP_TRANSFER = 57

  # 敵のパラメーター補正を与える変数
  EXP = 46 # 取得経験値
  MONEY = 47 # 取得ゴールド
  MMP = 48 # 最大MP

  # チャレンジバトルモードで戦闘が中断するターン数を設定する変数の番号
  CHALLENGE_BATTLE_TURN = 84
  # チャレンジバトルモードで敵に与えたダメージの合計値を格納する変数の番号
  CHALLENGE_BATTLE_DAMAGE = 85

  # 混沌の迷宮・修羅の到達階層を保存する変数の番号 値が1以上なら「今回の冒険」に表示
  EX_DUNGEON_REACH2 = 156

end

#==============================================================================
# ■ NWConst::Actor
#==============================================================================
module NWConst::Actor
  # ルカのアクターID
  LUCA = 1
  # 個人レベル最大値
  MAX_BASE_LEVEL = 9999
  # <習得不可>スキルを習得できないアクターのID
  NOT_LEARN_ACTORS = [1,2,3,4,9,10,520,521,522,523,526,527,531,535,538,539,540,541,542,543,563,564,565,566,567,569,701,702,703,801,807,811,815,819,823,922,923]

  # 武器として盾を装備している場合の通常攻撃のアニメーションID
  DUAL_SHIELD_ANIMATION_ID = 17

end

#==============================================================================
# ■ NWConst::Class
#==============================================================================
module NWConst::Class
  # 職業・種族範囲
  JOB_RANGE   = (1..149).to_a + (6998..7100).to_a
  TRIBE_RANGE = (151..370).to_a + (7401..7455).to_a
  # アクターの基礎ステータス用職業ベース値
  # 実際にアクセスするのはベース値+アクターID
  BASE_PARAM_BASE = 400
  # 種族「人間」のID
  HUMANS = [151]
end

#==============================================================================
# ■ NWConst::Item
#==============================================================================
module NWConst::Item
  # ポケット魔王城アイテムID
  POCKET_CASTLE = 501
  # プレゼントアイテムID範囲
  PRESENT_RANGE = (301..460)  
end

module NWConst::Enchantment
  # IDの範囲の武器が秘武器として扱われる。
  WEAPON_ID = 1000..4080

  # IDの範囲の防具が秘防具として扱われる。
  ARMOR_ID = 2500..3799
end

#==============================================================================
# ■ NWConst::Skill
#==============================================================================
module NWConst::Skill
  BIND_RESIST = 52        # 「もがく」のスキルID
  MERCY = 51              # 「なすがまま」のスキルID
  DEFAULT_TEMPTATION = 31 # 個別スキル未設定時に適用される誘惑時スキル
  NO_VALID_ACTION  = 4241 # 敵が選択可能な行動がない場合の代用スキル
end 
 
#==============================================================================
# ■ NWConst::Common
#==============================================================================
module NWConst::Common
  MAP_DRAW     = 2 # 地図表示用コモンイベント
  CALL_CASTLE  = 3 # "Карманный Замок"の呼び出しコモンイベント
  BATTLE_START = 4 # 戦闘開始時に予約するコモンイベント
  BATTLE_END   = 5 # 戦闘終了時に予約するコモンイベント
  GIVEUP_START = 9 # 降参時に予約するコモンイベント
  LOSE_EVENT_BASE = 3000 # 敗北時に起動するコモンイベントベース値
end
 
#==============================================================================
# ■ NWConst::State
#==============================================================================
module NWConst::State
  UBIND   = 3  # 拘束使用者ステートID
  TBIND   = 4  # 拘束対象ステートID
  EUBIND  = 5  # 永久拘束使用者ステートID
  ETBIND  = 6  # 永久拘束対象ステートID
  TEMPTATION = 26 # 誘惑ステートID
  INCONTINENCE = 27 # 失禁ステートID

  # ラーニングが無効化される状態異常
  LEARNING_INVALID = [10,11,17,20,25,27]

end

#==============================================================================
# ■ NWConst::WType
#==============================================================================
module NWConst::WType
  # エネミーの基本武器タイプ
  DEFAULT_ENEMY = 0  
end

#==============================================================================
# ■ NWConst::SType
#==============================================================================
module NWConst::SType
  BIND     = 65 # 拘束中スキルタイプID
  EBIND    = 66 # 永久拘束中スキルタイプID
end

#==============================================================================
# ■ NWConst::Elem
#==============================================================================
module NWConst::Elem
  # 快楽属性のID
  # 台詞・カウントの特殊化に必要
  PLEASURE = 2

  # 耐性無視・反射吸収無効となる属性ID
  RATE_FIX_ID = [41, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53]

  # 属性一致ボーナスを適応しないID
  IGNORE_SAME_ELEMENT_DAMAGE_BONUS = 1, 2

  # 属性一致ボーナスに追加される値 基本値は(100+設定した値)%
  SAME_ELEMENT_DAMAGE_BONUS_VALUE = 20

end


module  NWConst::Actor

  #最大HP上限
  MAX_MHP = 999999999999999
  #その他能力値上限
  MAX_PARAM = 999999999999999

  #最大HPの追加成長値上限
  MAX_MHP_PLUS = 999999999
  #その他能力値の追加成長値上限
  MAX_PARAM_PLUS = 99999999

end

#==============================================================================
# ■ NWConst::Party
#==============================================================================
module NWConst::Party
  #所持金上限
  MAX_MONEY = 999999999
end

module NWConst::Troop
  # チャレンジバトルモードで戦闘を行う敵グループID　複数指定は「,」で区切る
  CHALLENGE_BATTLE = 328
end

# -*- encoding: utf-8 -*-
=begin
=ダメージ計算式

=end

#==============================================================================
# ■ NWConst::Parameter
#==============================================================================
module NWConst::Parameter
  # 武器タイプに応じた基礎攻撃力の算出計算式テーブル
  WEAPON_TYPE_DAMAGE = {
  # ID => "算出式(スキル使用者の能力をa.atkやa.defなどで参照可能)"
    1 => "(a.atk + a.luk) * 1.2",
    2 => "a.atk * 2",
    3 => "a.atk * 2",
    4 => "a.atk * 2.5",
    5 => "(a.atk + a.agi) * 1.2",
    6 => "(a.atk + a.mat) * 1.2",
    7 => "(a.atk + a.agi) * 1.2",
    8 => "(a.atk + a.agi) * 1.2",
    9 => "(a.atk + a.luk) * 1.2",
    10 => "(a.atk + a.luk) * 1.2",
    11 => "(a.atk + a.agi) * 1.2",
    12 => "a.atk * 2",
    13 => "a.atk * 2",
    14 => "a.atk * 2",
    15 => "a.atk * 2",
    16 => "(a.atk * 3 + a.mat) / 2 * 1.2",
    17 => "(a.atk * 3 + a.mat) / 2 * 1.2",
    18 => "(a.atk + a.luk) * 1.2",
    19 => "(a.atk + a.luk) * 1.2",
    20 => "a.luk * 2",
    21 => "(a.atk + a.luk) * 1.2",
    22 => "a.atk * 2",
    23 => "(a.luk + a.agi) * 1.2",
    24 => "(a.atk + a.luk) * 1.2",
    25 => "a.atk * 2",
    26 => "(a.atk + a.luk) * 1.2",
    27 => "(a.atk + a.luk) * 1.2",
    28 => "(a.atk + a.luk) * 1.2",
    29 => "a.atk * 2",
    30 => "a.luk * 2",
    31 => "a.luk * 2",
    32 => "a.atk * 2",
    99 => "a.def * 2",
  # 0番は素手での基礎攻撃力算出式となります。
    0 => "a.atk * 2"
  }

  # Lv100以降の計算式
  # 最大HP
  LEVEL_100_MHP = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 最大MP
  LEVEL_100_MMP = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 攻撃力
  LEVEL_100_ATK = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 防御力
  LEVEL_100_DEF = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 魔力
  LEVEL_100_MAT = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 精神力
  LEVEL_100_MDF = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 素早さ
  LEVEL_100_AGI = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 器用さ
  LEVEL_100_LUK = "lv * d + ((lv * (lv -1)) / 2) * d / 1000"
  # 必要経験値
  LEVEL_100_EXP = "lv * d + ((lv * (lv -1)) / 2) * 10000"
  # 必要経験値が上昇するレベルの上限
  LEVEL_EXP_MAX = 1000

end

#==============================================================================
# ■ NWConst::Map
#==============================================================================
module NWConst::Map
  # エラーチェックを省略したので
  # ダメージ床が存在しない地形タグも全て対応数値を入力してください
  DAMAGE_FLOOR = {
    # 地形タグ  => ダメージ量,
    0           => 2,
    1           => 10,
    2           => 2,
    3           => 2,
    4           => 2,
    5           => 2,
    6           => 2,
    7           => 2,
    8           => 50,
  }
end

module NWConst
  module Audio
    AUDIO_ALIAS = {
    "Audio/BGM/cb1" => "System/sys1", "Audio/BGM/cb2" => "System/sys2", "Audio/BGM/cb3" => "System/sys3", "Audio/BGM/cb4" => "System/sys4", "Audio/BGM/cb5" => "System/sys5"
    }
  end
end

# -*- encoding: utf-8 -*-
=begin
=図鑑_地名データ設定セクション by Foo

図鑑の地名に関するデータを登録します

==更新履歴
Date     Version Author Comment
13/07/24 1.0,0   Foo    新設


=end

#==============================================================================
# ■ NWConst::Library
#==============================================================================
module NWConst::Library  
  # 図鑑用地名
  # 文字列はシンボルで統一してください
  PLACE = [
    :"Илиасвиль",
    :"Храм Илиас",
    :"Илиасбург",
    :"Безымянные Трущобы",
    :"Порноф",
    :"Деревня Счастья",
    :"Деревня Гарпий",
    :"Деревня Мидаса",
    :"Энрика",
    :"Деревня Рострум",
    :"Илиаспорт",
    :"Порт Наталия",
    :"Деревня Лудит",
    :"Сан-Илиа",
    :"Подземная Библиотека",
    :"Монте-Карло",
    :"Рубиана",
    :"Сабаса",
    :"Грандол",
    :"Деревня Магистия",
    :"Особняк Лили",
    :"Салун",
    :"Порт Марл",
    :"Штаб Флота",
    :"Финой",
    :"Гранд Ной",
    :"Деревня Яматай",
    :"Эста",
    :"Деревня Плантсект",
    :"Руины Деревни Лима",
    :"Годдаль",
    :"Грангольд",
    :"Гольдпорт",
    :"Деревня Суккубов",
    :"Деревня Леди",
    :"Опустошенная Земля",
    :"Деревня Эльфов",
    :"Деревня Кицунэ",
    :"Деревня Тануки",
    :"Снежные Небеса",
    :"Карманный Замок",
    :"Запечатанный Замок Митры",
    :"Тартар (Юг Континента Илиас)",
    :"Замок Королевы Медалей",
    :"Тартар (Восток Континента Илиас)",
    :"Особняк Призраков",
    :"Тартар (Север Континента Сабаса)",
    :"Рыбья Посудина",
    :"Магическая Академия",
    :"Тартар (Запад Континента Гольдо)",
    :"Корабль-Призрак",
    :"Заснеженный Храм",
    :"Часовня Хеллгондо",
    :"Запечатанная Темница Грешника",
    :"Тартар (Запад Континента Хеллгондо)",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Пещера Испытаний",
    :"Северная Пещера Гор Ирины",
    :"Южная Пещера Гор Ирины",
    :"Шахта Порноф",
    :"Башня Гарпий",
    :"Башня Слизней",
    :"Заброшенная Шахта Мидаса",
    :"Горная Пещера Рострум",
    :"Пещера Сокровищ",
    :"Южный Подводный Храм",
    :"Руины Древнего Храма",
    :"Пещера Искателя",
    :"Пирамида",
    :"Башня Магии",
    :"Заброшенная Шахта Салуна",
    :"Большой Проход Порта Марл",
    :"Пещера Великой Пиратки",
    :"Административная Башня",
    :"Шахта Окаменелостей",
    :"Пещера к Яматаю",
    :"Грот Орочи",
    :"Пещера к Лабиринту",
    :"Лабиринт Минотавра",
    :"Источник Ундины",
    :"Форт Гольдо",
    :"Лавовая Шахта",
    :"Вулканическая Пещера Гольдо",
    :"Замок Вампиров",
    :"Северный Подводный Храм",
    :"Заброшенная Башня",
    :"Мировое Древо",
    :"Уединенный Остров",
    :"Башня Кукловода",
    :"Заснеженная Пещера",
    :"Чертог Созидания",
    :"Пещера Хеллгондо",
    :"Замок Владыки Монстров",
    :"Горы Илиасвиля",
    :"Холм Талоса",
    :"Лес Потерянных",
    :"Побережье Ремузу",
    :"Побережье Наталия",
    :"Священная Гора Амос",
    :"Лес Духов",
    :"Холм Карлос",
    :"Оазис Благословения",
    :"Руины Пустыни Сафару",
    :"Холм Салун",
    :"Гора Редо",
    :"Великий Водопад Лайлы",
    :"Ядовитая Топь",
    :"Побережье Гольдо",
    :"Холмы Марша",
    :"Живописная Гора",
    :"Кошмарные Пустоши",
    :"Остров Фей",
    :"Гора Хорай",
    :"Развалины Храма Илиас",
    :"Деревня Суккубов (Другой Мир)",
    :"Пещера Хеллгондо (Другой Мир)",
    :"Континент Хеллгондо (Другой Мир)",
    :"Замок Владыки Монстров (Другой Мир)",
    :"Коллаб-Сценарий",
    :"Тартар (Эста)",
    :"Окрестности Эста (Небеса)",
    :"Окрестности Сабасы (Небеса)",
    :"Окрестности Гранд Ноа (Небеса)",
    :"Окрестности Грангольда (Небеса)",
    :"Континент Хеллгондо (Небеса)",
    :"Окрестности Сан-Илиа (Небеса)",
    :"Континент Илиас (Небеса)",
    :"Эста (Небеса)",
    :"Фонтан Ундины (Небеса)",
    :"Административная Башня (Небеса)",
    :"Рубиана (Небеса)",
    :"Руины Пустыни Сафару (Небеса)",
    :"Сабаса (Небеса)",
    :"Финой (Небеса)",
    :"Гранд Ной (Небеса)",
    :"Грангольд (Небеса)",
    :"Годдаль (Небеса)",
    :"Вулканическая Пещера Гольдо (Небеса)",
    :"Запечатанная Темница Грешника (Небеса)",
    :"Руины Замок Владыки Монстров (Небеса)",
    :"Институт Ремина (Небеса)",
    :"Замок Владыки Монстров  (Ангельская Профессия)",
    :"Порт Наталия (Небеса)",
    :"Деревня Лудит (Небеса)",
    :"Сан-Илиа (Небеса)",
    :"Лес Духов (Небеса)",
    :"Остров фей (Небеса)",
    :"Чёрный Особняк",
    :"Институт Альянса Мудрости (Небеса)" ,
    :"Луна",
    :"Священная гора Амос (Небеса)",
    :"Илиасбург (Небеса",
    :"Запечатанный Замок Митры (Небеса)",
    :"Храм Илиас (Небеса)",
    :"Континент Хеллгондо (Мир Демонов)",
    :"Окрестности деревни Суккубов(Мир Демонов)",
    :"Грангольд (Мир Демонов)",
    :"Гранд Ной (Мир Демонов)",
    :"Окрестности  Яматай (Мир Демонов)",
    :"Окрестности Сан-Илиа (Мир Демонов)",
    :"Окрестности  Сабасы (Мир Демонов)",
    :"Континент Илиас (Мир Демонов)",
    :"Станция Мира Демонов (Мир Демонов)",
    :"Деревня Суккубов (Мир Демонов)",
    :"Гольдпорт(Мир Демонов)",
    :"Грангольд (Мир Демонов)",
    :"Форт Гольдо(Мир Демонов)",
    :"Окрестности Илиасвиль",
    :"Окрестности Илиасбурга",
    :"Окрестности Безымянных Трущоб",
    :"Окрестности Порнофа",
    :"Окрестности Деревни Счастья",
    :"Окрестности  Илиаспорт",
    :"Восток Региона Наталия",
    :"Запад Региона Наталия",
    :"Юг Пустыни Сабаса",
    :"Север Пустыни Сабаса",
    :"Окресности Деревни Магистия",
    :"Окрестности Порта Марл",
    :"Внутреннее Море",
    :"Окрестности Гранд Ноа",
    :"Окрестности Яматая",
    :"Окрестности Эсты",
    :"Окрестносоти Грангольда",
    :"Окрестности Деревни Суккубов",
    :"Окресности Опустошенной Земли",
    :"Внешнеее Море",
    :"Окресности Острова Фей",
    :"Континент Хеллгондо",
    :"Окресности Снежных Небес",
    :"Поле (Небесный Мир)",
    :"Поле (Мир Демонов)",
    :"Различные Места",
    :"Окресности Илиасвиля (Другой Мир)",
    :"Илиасвиль (Другой Мир)",
    :"Деревня Рострум (Другой Мир)",
    :"Готовка",
    :"Приз в Казино (Порноф)",
    :"Приз в Казино (Грандол)",
    :"Приз Казино (Карманный Замок)",
    :"Приз Колизея",
    :"Приз Секс-Битвы",
    :"Ремина (Другой Мир)",
    :"Окресности Годдаля",
    :"Гранд Ной (Мир Демонов)",
    :"Деревня Плантсект",
    :"Вулканическая Пещера Гольдо(Мир Демонов)",
    :"Фонтан Ундины (Мир Демонов)",
    :"Гора Хорай (Мир Демонов)",
    :"Деревня Яматай (Мир Демонов)",
    :"Финой (Мир Демонов)",
    :"Порт Наталия (Мир Демонов)",
    :"Лес Духов (Мир Демонов)",
    :"Сан-Илиа (Мир Демонов)",
    :"Монте-карло  (Мир Демонов)",
    :"Руины Пусты Сафару (Мир Демонов)",
    :"Сабаса  (Мир Демонов)",
    :"Энрика  (Мир Демонов)",
    :"Запечатаный Замок Митра  (Мир Демонов)",
    :"Место Памяти",
    :"Демиург (Мир Демонов)",
    :"Запечатанная Темница Грешника (Мир Демонов)",
    :"Замок Злой Богини (Мир Демонов)",
    :"Пещера Великой Пиратки (Мир Демонов)",
    :"Исследовательский институт Альянса мудрости",
    :"Институт Альянса мудрости",
    :"Разрушеный Карманный Замок Демонов",
    :"Илиасвиль (Хаос)",
    :"Илиасбург (Хаос)",
    :"Безымянные Трущобы (Хаос)",
    :"Порноф (Хаос)",
    :"Деревня Счастья (Хаос)",
    :"Деревня Гарпий (Хаос)",
    :"Деревня Мидаса (Хаос)",
    :"Энрика (Хаос)",
    :"Деревня Рострум (Хаос)",
    :"Илиаспорт (Хаос)",
    :"Порт Наталия (Хаос)",
    :"Деревня Лудит (Хаос)",
    :"Сан Илиа (Хаос)",
    :"Монте-Карло (Хаос)",
    :"Рубиана (Хаос)",
    :"Сабаса (Хаос)",
    :"Грандол (Хаос)",
    :"Деревня Магистия (Хаос)",
    :"Салун (Хаос)",
    :"Порт Марл (Хаос)",
    :"Штаб Флота (Хаос)",
    :"Финой (Хаос)",
    :"Гранд Ной (Хаос)",
    :"Деревня Яматай (Хаос)",
    :"Эста (Хаос)",
    :"Деревня Плантсект (Хаос)",
    :"Руины Деревни Лима (Хаос)",
    :"Годдаль (Хаос)",
    :"Грангольд (Хаос)",
    :"Гольдпорт (Хаос)",
    :"Деревня Суккубов (Хаос)",
    :"Храм Похоти (Хаос)",
    :"Деревня Леди (Хаос)",
    :"Снежные Небеса (Хаос)",
    :"Деревня Кицунэ (Хаос)",
    :"Деревня Тануки (Хаос)",
    :"Деревня Эльфов (Хаос)",
    :"Ремина (Хаос)",
    :"Институт Ремина (Хаос)",
    :"Запечатанный Замок Митры (Хаос)",
    :"Замок Королева Медалей (Хаос)",
    :"Особняк Призраков (Хаос)",
    :"Форт Гольдо (Хаос)",
    :"Магическая Академия (Хаос)",
    :"Корабль-Призрак (Хаос)",
    :"Опустошенная Земля (Хаос)",
    :"Храм Божественной Птицы (Хаос)",
    :"Лес Овечек (Хаос)",
    :"Остров Мимков (Хаос)",
    :"Заснеженный Храм (Хаос)",
    :"Чертог Созидания (Хаос)",
    :"Развалины Храма Илиас (Хаос)",
    :"Часовня Хеллгондо (Хаос)",
    :"Запечатанная Темница Грешника (Хаос)",
    :"Пещера Испытаний (Хаос)",
    :"Храм Жадности (Хаос)",
    :"Шахта Порноф (Хаос)",
    :"Башня Гарпий (Хаос)",
    :"Башня Слизней (Хаос)",
    :"Заброшенная Шахта Мидаса (Хаос)",
    :"Горная Пещера Рострум (Хаос)",
    :"Пещера Сокровищ (Хаос)",
    :"Южный Подводный Храм (Хаос)",
    :"Пещера Искателя (Хаос)",
    :"Башня Кукловода (Хаос)",
    :"Пирамида (Хаос)",
    :"Зал Зависти (Хаос)",
    :"Заброшенная Шахта Салуна (Хаос)",
    :"Административная Башня (Хаос)",
    :"Большой Проход Порта Марл (Хаос)",
    :"Пещера Великой Пиратки (Хаос)",
    :"Шахта Окаменелостей (Хаос)",
    :"Пещера к Лабиринту (Хаос)",
    :"Храм Гнева",
    :"Пещера к Яматаю (Хаос)",
    :"Грот Орочи (Хаос)",
    :"Фонтан Ундины (Хаос)",
    :"Лавовая Шахта (Хаос)",
    :"Северный Подводный Храм (Хаос)",
    :"Вулканическая Пещера Гольдо (Хаос)",
    :"Мировое Древо (Хаос)",
    :"Заснеженная Пещера (Хаос)",
    :"Храм Гордыни (Хаос)",
    :"Заброшенная Башня (Хаос)",
    :"Пещера Хеллгондо (Хаос)",
    :"Чёрный Особняк (Хаос)",
    :"Храм Илиас (Хаос)",
    :"Замок Злой Богини (Хаос)",
    :"Проклятый подводный храм (Хаос)",
    :"Пещера Запечатоного Демона (Хаос)",
    :"Башни Света и Тьмы",
    :"В Теле Лилит",
    :"Дорога Ле Рюи",
    :"Глубокий Хаос (Хаос)",
    :"Место Памяти (Хаос)",
    :"Институт Альянса Мудрости (Хаос)",
    :"Демиург (Хаос)",
    :"Разрушенный Демиург (Хаос)",
    :"Храм Смертных Грехов (Хаос)",
    :"Царство Хаоса (Хаос)",
    :"Горы Илиасвиля (Хаос)",
    :"Холм Талоса (Хаос)",
    :"Лес Потерянных (Хаос)",
    :"Побережье Ремузу (Хаос)",
    :"Побережье Наталия (Хаос)",
    :"Священная Гора Амос (Хаос)",
    :"Лес Духов (Хаос)",
    :"Холм Карлос (Хаос)",
    :"Оазис Благословения (Хаос)",
    :"Руины Пустыни Сафару",
    :"Холм Салун (Хаос)",
    :"Гора Хорай (Хаос)",
    :"Гештальт коллективного разума (Хаос)",
    :"Великий Водопад Лайлы (Хаос)",
    :"Ядовитая топь (Хаос)",
    :"Побережье Гольдо",
    :"Храм Чревоугодья (Хаос)",
    :"Кошмарная Пустыня (Хаос)",
    :"Остров Фей (Хаос)",
    :"Луна (Хаос)",
    :"Долина Падших Ангелов (Хаос)",
    :"Механическая Крепость на Луне (Хаос",
    :"Кузница Хаоса",
    :"Окрестности Илиасвиль (Хаос)",
    :"Окрестности Деревня Счастья (Хаос)",
    :"Окрестности Илиаспорт (Хаос)",
    :"Песчаный пляж Порт Наталия (хаос)",
    :"Окрестности Порт Наталия (Хаос)",
    :"Окрестности Монте-Карло (Хаос)",
    :"Пустыня Сабаса (Хаос)",
    :"Окресности Деревни Магистия",
    :"Окрестности Гранд Ноа (Хаос)",
    :"Окрестности  Яматай (Хаос)",
    :"Окрестности Эста (Хаос)",
    :"Окресности Годдаля (Хаос)",
    :"Окрестности Грангольда (Хаос)",
    :"Запад Континента Гольдо (Хаос)",
    :"Море (Хаос)",
    :"Континент Хеллгондо" (Хаос),
    :"Окрестности Снежных Небес (Хаос)",
    :"Окрестности Деревни Кицуне/Тануки (Хаос)",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Неизвестно",
    :"Поле (Хаос)",
    :"Различные Места (Хаос)",
    :"Призы Казино (Хаос)",
    :"Призы Колизея (Хаос)",
    :"Приз Секс-Битв (Хаос)",
    :"Ядро Звезды (Хаос)",
    :"Йоми-Хирасака (Хаос)",
    :"Ле Рюй (Хаос)",
    :"Небеса (Хаос)",
    :"Кошмар Гранберии (Хаос)",
    :"Изначальная Лаборатория",
    :"Оазис Благословения (Мир Демонов)",
    :"Пай-Пай (Небеса)",
    :"Пай-Пай (Мир Демонов)",
    :"Пай-Пай (Хаос)",
    :"Пай-Пай (Хаос, Другой Мир)",
    :"Магазин Ванилы",
    :"Преисподняя",
    :"Собрание четырех духов (хаос)",
    :"Полпути 16 Катастроф",
    :"Пройден Путь 16 Катастроф",
    :"Истиный Финал",
    :"Часовня Хеллгондо (Мир Демонов",

  ]
end

# -*- encoding: utf-8 -*-
=begin
= ワープの設定

スイッチ関係は重複を避ける為にIDReserve.rbで管理しています
禁止したい場合はWARP_BANの値を
個別開放したい場合はWARP_FREE_BASE値を設定してください

=end

#==============================================================================
# ■ NWConst::Warp
#==============================================================================
module NWConst::Warp
  # ワープ先一覧
  Places = [
    {:name => "Карманный Замок", :map_id => 126, :x => 15, :y => 13, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Храм Илиас", :map_id => 5, :x => 24, :y => 11, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Илиасвиль", :map_id => 2, :x => 295, :y => 356, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Илиасбург", :map_id => 2, :x => 300, :y => 326, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 302, 326]},    
    {:name => "Безымянные Трущобы", :map_id => 2, :x => 236, :y => 341, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 235, 341]},    
    {:name => "Порноф", :map_id => 2, :x => 349, :y => 377, :category => :地上,
      :v2location => [[2, 349, 382, "v[1001]>=30"],[2, 284, 274, "true"]], :v3location => [2, 351, 377]},
    {:name => "Деревня Счастья", :map_id => 2, :x => 353, :y => 326, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 352, 326]},    
    {:name => "Деревня Мидаса", :map_id => 2, :x => 366, :y => 279, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 367, 279]},    
    {:name => "Замок Королевы Медалей", :map_id => 2, :x => 338, :y => 273, :category => :地上,
      :v2location => [2, 338, 268], :v3location => [2, 339, 273]},    
    {:name => "Энрика", :map_id => 2, :x => 241, :y => 368, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 284, 363]},    
    {:name => "Деревня Рострум", :map_id => 2, :x => 385, :y => 354, :category => :地上,
      :v2location => [[2, 388, 353, "v[1001]>=30"],[2, 284, 274, "true"]], :v3location => [2, 386, 354]},   
    {:name => "Илиаспорт", :map_id => 2, :x => 282, :y => 275, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 281, 275]},    
    {:name => "Порт Наталия", :map_id => 2, :x => 282, :y => 260, :category => :地上,
      :v2location => [2, 284, 261], :v3location => [2, 281, 260]},    
    {:name => "Деревня Лудит", :map_id => 2, :x => 257, :y => 250, :category => :地上,
      :v2location => [2, 284, 261], :v3location => [2, 258, 250]},    
    {:name => "Сан-Илиа", :map_id => 2, :x => 236, :y => 261, :category => :地上,
      :v2location => [[2, 234, 268, "v[1001]>=30"],[2, 284, 261, "true"]], :v3location => [2, 238, 261]}, 
    {:name => "Монте-Карло", :map_id => 2, :x => 200, :y => 273, :category => :地上,
      :v2location => [2, 284, 261], :v3location => [2, 201, 273]},    
    {:name => "Рубиана", :map_id => 2, :x => 142, :y => 317, :category => :地上,
      :v2location => [[2, 141, 318, "v[1001]>=30"],[2, 284, 261, "true"]], :v3location => [2, 143, 317]},
    {:name => "Сабаса", :map_id => 2, :x => 103, :y => 294, :category => :地上,
      :v2location => [[2, 104, 296, "v[1001]>=30"],[2, 100, 225 ,"true"]], :v3location => [2, 105, 294]},    
    {:name => "Грандол", :map_id => 2, :x => 85, :y => 272, :category => :地上,
      :v2location => [2, 100, 225], :v3location => [2, 84, 272]},    
    {:name => "Деревня Магистия", :map_id => 2, :x => 47, :y => 295, :category => :地上,
      :v2location => [[2, 37, 292, "v[1001]>=30"],[2, 100, 225, "true"]], :v3location => [2, 46, 295]},  
    {:name => "Салун", :map_id => 2, :x => 98, :y => 230, :category => :地上,
      :v2location => [2, 100, 225], :v3location => [2, 100, 230]},    
    {:name => "Порт Марл", :map_id => 2, :x => 254, :y => 234, :category => :地上,
      :v2location => [2, 253, 232], :v3location => [2, 253, 234]},    
    {:name => "Штаб Флота", :map_id => 2, :x => 335, :y => 240, :category => :地上,
      :v2location => [2, 334, 240], :v3location => [2, 338, 240]},    
    {:name => "Финой", :map_id => 2, :x => 330, :y => 209, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 329, 209]},    
    {:name => "Гранд Ной", :map_id => 2, :x => 328, :y => 187, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 327, 187]},    
    {:name => "Деревня Яматай", :map_id => 2, :x => 372, :y => 166, :category => :地上,
      :v2location => [[2, 379, 167, "v[1001]>=30"],[2, 322, 227, "true"]], :v3location => [2, 374, 166]},  
    {:name => "Эста", :map_id => 2, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 263, 202]},    
    {:name => "Деревня Плантсект", :map_id => 2, :x => 283, :y => 198, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 282, 198]},    
    {:name => "Руины Деревни Лима", :map_id => 2, :x => 236, :y => 179, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 235, 179]},    
    {:name => "Годдаль", :map_id => 2, :x => 221, :y => 176, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 223, 176]},    
    {:name => "Грангольдド", :map_id => 2, :x => 234, :y => 154, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 233, 154]},    
    {:name => "Гольдпорт", :map_id => 2, :x => 234, :y => 131, :category => :地上,
      :v2location => [[2, 233, 130, "v[1001]>=30"],[2, 322, 227, "true"]], :v3location => [2, 236, 131]}, 
    {:name => "Деревня Суккубов", :map_id => 2, :x => 165, :y => 142, :category => :地上,
      :v2location => [[2, 168, 121, "v[1001]>=30"],[2, 322, 227, "true"]], :v3location => [2, 167, 142]},  
    {:name => "Деревня Леди", :map_id => 2, :x => 150, :y => 122, :category => :地上,
      :v2location => [[2, 168, 121, "v[1001]>=30"],[2, 322, 227, "true"]], :v3location => [2, 152, 122]},  
    {:name => "Храм Божественной Птицы ", :map_id => 2, :x => 134, :y => 125, :category => :地上,
      :v2location => [[2, 168, 121, "v[1001]>=30"],[2, 322, 227, "true"]], :v3location => [2, 135, 125]},   
    {:name => "Остров Фей", :map_id => 2, :x => 42, :y => 348, :category => :地上,
      :v2location => [2, 46, 338], :v3location => [2, 43, 346]},    
    {:name => "Деревня Эльфов", :map_id => 300, :x => 23, :y => 50, :category => :地上,
      :v2location => [2, 365, 157], :v3location => [2, 372, 160]},    
    {:name => "Деревня Кицунэ", :map_id => 2, :x => 388, :y => 158, :category => :地上,
      :v2location => [2, 379, 167], :v3location => [2, 389, 158]},    
    {:name => "Снежные Небеса", :map_id => 2, :x => 89, :y => 158, :category => :地上,
      :v2location => [2, 82, 144], :v3location => [2, 91, 158]},    
    {:name => "Развалины Храма Илиас", :map_id => 2, :x => 33, :y => 193, :category => :地上,
      :v2location => [2, 82, 144], :v3location => [2, 35, 193]},    
    {:name => "Часовня Хеллгондо", :map_id => 2, :x => 223, :y => 93, :category => :地上,
      :v2location => [2, 203, 102], :v3location => [2, 297, 356]},    
    {:name => "Замок Владыки Монстров", :map_id => 2, :x => 164, :y => 55, :category => :地上,
      :v2location => [2, 203, 102], :v3location => [2, 297, 356]},    

    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Административная Башня", :map_id => 1303, :x => 25, :y => 23, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Эста", :map_id => 1193, :x => 261, :y => 202, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Рубиана", :map_id => 1193, :x => 142, :y => 317, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Сабаса", :map_id => 1193, :x => 103, :y => 294, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},   
    {:name => "Финой", :map_id => 1193, :x => 330, :y => 209, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Гранд Ной", :map_id => 1193, :x => 328, :y => 187, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Грангольд", :map_id => 1193, :x => 234, :y => 154, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Годдаль", :map_id => 1193, :x => 226, :y => 174, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Запечатанная Темница Грешника", :map_id => 1193, :x => 243, :y => 82, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Замок Владыки Монстров", :map_id => 1193, :x => 162, :y => 50, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},  
    {:name => "Порт Наталия", :map_id => 1193, :x => 282, :y => 260, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Сан-Илиа", :map_id => 1193, :x => 236, :y => 260, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Институт Альянса Мудрости", :map_id => 1495, :x => 29, :y => 56, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Дом Люцифины", :map_id => 1006, :x => 23, :y => 6, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Илиасбург  (Небеса)", :map_id => 1193, :x => 300, :y => 326, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},   
    {:name => "Храма Илиас (Небеса)", :map_id => 1193, :x => 295, :y => 356, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},    
    {:name => "Храм Илиас (Небеса)", :map_id => 1890, :x => 29, :y => 54, :category => :天界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 

    {:name => "Часовня Хеллгондо (Мир Демонов)", :map_id => 1001, :x => 223, :y => 92, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Деревня Суккубов (Мир Демонов)", :map_id => 1001, :x => 165, :y => 141, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Гольдпорт(Мир Демонов)", :map_id => 1001, :x => 234, :y => 130, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Грангольд (Мир Демонов)", :map_id => 1001, :x => 234, :y => 153, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Деревня Плантсект (Мир Демонов)", :map_id => 1001, :x => 283, :y => 197, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Гранд Ноя (Мир Демонов)", :map_id => 1001, :x => 328, :y => 186, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Деревня Яматай (Мир Демонов)", :map_id => 1001, :x => 372, :y => 165, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Финой (Мир Демонов)", :map_id => 1001, :x => 330, :y => 208, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Порт Наталия (Мир Демонов)", :map_id => 1001, :x => 282, :y => 261, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Сан Илиа (Мир Демонов)", :map_id => 1001, :x => 237, :y => 260, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Монте-Карло (Мир Демонов)", :map_id => 1001, :x => 200, :y => 272, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Сабаса (Мир Демонов)", :map_id => 1001, :x => 103, :y => 293, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Энрика (Мир Демонов)", :map_id => 1001, :x => 240, :y => 368, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Замок Злой Богини (Мир Демонов)", :map_id => 1001, :x => 164, :y => 54, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Замок Злой Богини (Мир Демонов)", :map_id => 1650, :x => 30, :y => 52, :category => :魔界,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},  

    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]},  
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Илиасвиль (Другой Мир)", :map_id => 196, :x => 59, :y => 54, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Деревня Рострум (Другой Мир)", :map_id => 195, :x => 38, :y => 20, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Административная Башня (Другой Мир)", :map_id => 197, :x => 58, :y => 12, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Деревня Суккубов (Другой Мир)", :map_id => 194, :x => 74, :y => 120, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Ремина (Другой Мир)", :map_id => 194, :x => 55, :y => 63, :category => :地上,
      :v2location => [2, 322, 227], :v3location => [2, 117, 138]},    
    {:name => "Замок Владыки Монстров (Другой Мир)", :map_id => 194, :x => 73, :y => 33, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Институт Альянса Мудрости (Другой Мир)", :map_id => 439, :x => 29, :y => 56, :category => :地上,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 

    {:name => "Неизвестно", :map_id => 1193, :x => 261, :y => 202, :category => :混沌,
      :v2location => [2, 284, 274], :v3location => [2, 297, 356]}, 
    {:name => "Карманный Замок", :map_id => 126, :x => 15, :y => 13, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 297, 356]},
    {:name => "Храм Илиас", :map_id => 1791, :x => 15, :y => 19, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [[1287, 297, 356, "v[1143]>=21"],[1287, 0, 0, "true"]]}, 
    {:name => "Илиасвиль", :map_id => 1287, :x => 295, :y => 356, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [[1287, 297, 356, "v[1143]>=21"],[1287, 0, 0, "true"]]}, 
    {:name => "Илиасбург", :map_id => 1287, :x => 300, :y => 326, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 302, 326]},
    {:name => "Безымянные Трущобы (Хаос)", :map_id => 1287, :x => 236, :y => 341, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [[1287, 235, 341, "v[1143]>=21"],[1287, 0, 0, "true"]]}, 
    {:name => "Порноф (Хаос)", :map_id => 1287, :x => 349, :y => 377, :category => :混沌,
      :v2location => [1287, 349, 382], :v3location => [1287, 351, 377]},
    {:name => "Деревня Счастья (Хаос)", :map_id => 1287, :x => 353, :y => 326, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 352, 326]},
    {:name => "Деревня Мидаса (Хаос)", :map_id => 1287, :x => 366, :y => 279, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 367, 279]},
    {:name => "Замок Королева Медалей (Хаос)", :map_id => 1287, :x => 338, :y => 273, :category => :混沌,
      :v2location => [1287, 338, 268], :v3location => [1287, 339, 273]},
    {:name => "Энрика", :map_id => 1287, :x => 241, :y => 368, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [[1287, 284, 363, "v[1143]>=21"],[1287, 0, 0, "true"]]}, 
    {:name => "Запечатаный Замок Митра", :map_id => 1287, :x => 235, :y => 354, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [[1287, 237, 353, "v[1143]>=21"],[1287, 0, 0, "true"]]}, 
    {:name => "Деревня Рострум (Хаос)", :map_id => 1287, :x => 385, :y => 354, :category => :混沌,
      :v2location => [1287, 388, 353], :v3location => [1287, 386, 354]},   
    {:name => "Илиаспорт (Хаос)", :map_id => 1287, :x => 282, :y => 275, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 281, 275]},
    {:name => "Порт Наталия (Хаос)", :map_id => 1287, :x => 282, :y => 260, :category => :混沌,
      :v2location => [1287, 284, 261], :v3location => [1287, 281, 260]},
    {:name => "Деревня Лудит (Хаос)", :map_id => 1287, :x => 257, :y => 250, :category => :混沌,
      :v2location => [1287, 284, 261], :v3location => [1287, 258, 250]},
    {:name => "Сан Илиа (Хаос)", :map_id => 1287, :x => 236, :y => 261, :category => :混沌,
      :v2location => [1287, 234, 268], :v3location => [1287, 238, 261]}, 
    {:name => "Монте-Карло (Хаос)", :map_id => 1287, :x => 200, :y => 273, :category => :混沌,
      :v2location => [1287, 284, 261], :v3location => [1287, 201, 273]},
    {:name => "Рубиана (Хаос)", :map_id => 1287, :x => 142, :y => 317, :category => :混沌,
      :v2location => [1287, 141, 318], :v3location => [1287, 143, 317]},
    {:name => "Сабаса (Хаос)", :map_id => 1287, :x => 103, :y => 294, :category => :混沌,
      :v2location => [1287, 104, 296], :v3location => [1287, 105, 294]},
    {:name => "Грандол (Хаос)", :map_id => 1287, :x => 85, :y => 272, :category => :混沌,
      :v2location => [1287, 100, 225], :v3location => [1287, 84, 272]},
    {:name => "Деревня Магистия (Хаос)", :map_id => 1287, :x => 47, :y => 295, :category => :混沌,
      :v2location => [1287, 37, 292], :v3location => [1287, 46, 295]},  
    {:name => "Салун (Хаос)", :map_id => 1287, :x => 98, :y => 230, :category => :混沌,
      :v2location => [1287, 100, 225], :v3location => [1287, 100, 230]},
    {:name => "マールポート", :map_id => 1287, :x => 254, :y => 234, :category => :混沌,
      :v2location => [1287, 253, 232], :v3location => [1287, 253, 234]},
    {:name => "Штаб Флота (Хаос)", :map_id => 1287, :x => 335, :y => 240, :category => :混沌,
      :v2location => [1287, 334, 240], :v3location => [1287, 338, 240]},
    {:name => "Финой (Хаос)", :map_id => 1287, :x => 330, :y => 209, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 329, 209]},
    {:name => "Гранд Ной (Хаос)", :map_id => 1287, :x => 328, :y => 187, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 327, 187]},
    {:name => "Деревня Яматай (Хаос)", :map_id => 1287, :x => 372, :y => 166, :category => :混沌,
      :v2location => [1287, 379, 167], :v3location => [1287, 374, 166]},  
    {:name => "Эста (Хаос)", :map_id => 1287, :x => 261, :y => 202, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 263, 202]},
    {:name => "Деревня Плантсект (Хаос)", :map_id => 1287, :x => 283, :y => 198, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 282, 198]},
    {:name => "Руины Деревни Лима (Хаос)", :map_id => 1287, :x => 236, :y => 179, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 235, 179]},
    {:name => "Годдаль (Хаос)", :map_id => 1287, :x => 221, :y => 176, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 223, 176]},
    {:name => "Грангольд (Хаос)", :map_id => 1287, :x => 234, :y => 154, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 233, 154]},
    {:name => "Гольдпорт (Хаос)", :map_id => 1287, :x => 234, :y => 131, :category => :混沌,
      :v2location => [1287, 233, 130], :v3location => [1287, 236, 131]}, 
    {:name => "Деревня Суккубов (Хаос)", :map_id => 1287, :x => 165, :y => 142, :category => :混沌,
      :v2location => [1287, 168, 121], :v3location => [1287, 167, 142]},  
    {:name => "Деревня Леди (Хаос)", :map_id => 1287, :x => 150, :y => 122, :category => :混沌,
      :v2location => [1287, 168, 121], :v3location => [1287, 152, 122]},  
    {:name => "Храм Божественной Птицы (Хаос)", :map_id => 1287, :x => 134, :y => 125, :category => :混沌,
      :v2location => [1287, 168, 121], :v3location => [1287, 135, 125]},   
    {:name => "Остров Фей (Хаос)", :map_id => 1287, :x => 42, :y => 348, :category => :混沌,
      :v2location => [1287, 46, 338], :v3location => [1287, 43, 346]},
    {:name => "Деревня Эльфов (Хаос)", :map_id => 1504, :x => 23, :y => 50, :category => :混沌,
      :v2location => [1287, 365, 157], :v3location => [1287, 372, 160]},
    {:name => "Деревня Кицунэ (Хаос)", :map_id => 1287, :x => 388, :y => 158, :category => :混沌,
      :v2location => [1287, 379, 167], :v3location => [1287, 389, 158]},
    {:name => "Снежные Небеса (Хаос)", :map_id => 1287, :x => 89, :y => 158, :category => :混沌,
      :v2location => [1287, 82, 144], :v3location => [1287, 91, 158]},
    {:name => "Развалины Храма Илиас (Хаос)", :map_id => 1287, :x => 33, :y => 193, :category => :混沌,
      :v2location => [1287, 82, 144], :v3location => [1287, 35, 193]},
    {:name => "Часовня Хеллгондо (Хаос)", :map_id => 1287, :x => 223, :y => 93, :category => :混沌,
      :v2location => [1287, 203, 102], :v3location => [1287, 222, 93]},
    {:name => "Запечатанная Темница Грешника (Хаос)", :map_id => 1287, :x => 244, :y => 84, :category => :混沌,
      :v2location => [1287, 203, 102], :v3location => [1287, 245, 84]},
    {:name => "Ремина (Хаос)", :map_id => 1287, :x => 146, :y => 89, :category => :混沌,
      :v2location => [1287, 203, 102], :v3location => [1287, 148, 87]},
    {:name => "Замок Злой Богини (Хаос)", :map_id => 1287, :x => 164, :y => 55, :category => :混沌,
      :v2location => [1287, 203, 102], :v3location => [1287, 166, 55]},
    {:name => "Дом Люцифины (Хаос)", :map_id => 1840, :x => 23, :y => 6, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 297, 356]},
    {:name => "Механическая Крепость на Луне (Хаос)", :map_id => 1837, :x => 40, :y => 16, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 297, 356]},
    {:name => "Пещера Запечатоного Демона (Хаос)", :map_id => 1287, :x => 182, :y => 158, :category => :混沌,
      :v2location => [1287, 322, 227], :v3location => [1287, 182, 160]},
    {:name => "Царство Хаоса (Хаос)", :map_id => 1836, :x => 10, :y => 8, :category => :混沌,
      :v2location => [1287, 284, 274], :v3location => [1287, 297, 356]}, 

  ]  
end

# -*- encoding: utf-8 -*-
=begin
= フィールド特殊化

=end

#==============================================================================
# ■ NWConst::Field
#==============================================================================
module NWConst::Field
  # フィールド特殊化マップID
  # 現在
  # ・"Карманный Замок"呼び出し可能判定
  # ・マップ表示呼び出し可能判定
  # ・マップ軽量化
  # の３つが適用されます
  FIELD_MAP_ID = [2, 1001, 1193, 1287]
  # BGMの自動切替適用マップID
  AUTO_BGM_MAP_ID = [2,194]
  
  # フェードアウトに掛けるフレーム数
  # ※除算にも使っているので絶対に0は指定しないでください
  FADEOUT_FRAME = 120
  # フェードインに掛けるフレーム数
  FADEIN_FRAME  = 60
  
  # BGM設定
  BGM = {
    # マップID
    2 => {
      # 0はリージョンが未設定の状態です。引数はname, volume, pitch
      0 => RPG::BGM.new("field1", 100, 100),
      1 => RPG::BGM.new("field1", 100, 100),
      2 => RPG::BGM.new("field1", 100, 100),
      3 => RPG::BGM.new("field1", 100, 100),
      4 => RPG::BGM.new("field1", 100, 100),
      5 => RPG::BGM.new("field1", 100, 100),
      6 => RPG::BGM.new("field1", 100, 100),
      7 => RPG::BGM.new("field2", 100, 100),
      8 => RPG::BGM.new("field2", 100, 100),
      9 => RPG::BGM.new("field2", 100, 100),
      10 => RPG::BGM.new("sabaku", 100, 100),
      11 => RPG::BGM.new("sabaku", 100, 100),
      12 => RPG::BGM.new("field2", 100, 100),
      13 => RPG::BGM.new("field2", 100, 100),
      14 => RPG::BGM.new("field2", 100, 100),
      15 => RPG::BGM.new("umi", 100, 100),
      16 => RPG::BGM.new("field2", 100, 100),
      17 => RPG::BGM.new("field2", 100, 100),
      18 => RPG::BGM.new("field2", 100, 100),
      19 => RPG::BGM.new("field2", 100, 100),
      20 => RPG::BGM.new("field2", 100, 100),
      21 => RPG::BGM.new("field2", 100, 100),
      22 => RPG::BGM.new("umi", 100, 100),
      23 => RPG::BGM.new("field2", 100, 100),
      24 => RPG::BGM.new("field3", 100, 100),
      25 => RPG::BGM.new("field4", 100, 100),
      26 => RPG::BGM.new("field2", 100, 100),
    },
    194 => {
      0 => RPG::BGM.new("field2", 100, 100),
      1 => RPG::BGM.new("field2", 100, 100),
      2 => RPG::BGM.new("field2", 100, 100),
      3 => RPG::BGM.new("umi", 100, 100),
      4 => RPG::BGM.new("field4", 100, 100),
    }
  }
  # BGS設定
  BGS = {
    2 => {
      #22 => RPG::BGS.new("Sea", 100, 100),
    },
    194 => {
    
    }
  }
  # 地形定義
  TERRAIN = {
    :森 => {
      :tag => 1,
      :map_id => [125,128,132,153,205,206,207,208,209,331,332,333,415,416,417,443,446,668,670,674,767,813,816,828,832,
        1107,1108,1203,1204,1212,1213,1214,1215,1216,1217,1218,1219,1220,1306,1307,1308,1435,1436,1525,1526,1528,1529,1600,1756,1757,1758,1786,1787,1828,1829,1830,1847,1869,
      ],
     },
    :砂漠 => {
      :tag => 2,
      :map_id => [114,115,116,117,307,379,380,381,393,397,404,405,407,408,409,410,411,412,413,414,445,449,653,655,662,676,677,688,695,769,786,1221,1222,1223,1224,1225,1226,1227,
        1228,1229,1230,1231,1233,1234,1235,1236,1237,1238,1239,1240,1241,1309,1310,1311,1639,1640,1641,1642,1743,1822,1810,1877,1924,
      ],
    },
    :海 => {
      :tag => 3,
      :map_id => [
        124,127,131,369,370,371,372,373,376,478,479,671,672,685,689,690,696,701,762,776,763,784,796,825,1428,1498,1499,1592,1740,1741,1750,1915,1920,1922,1923,
      ],
    },
    :深海 => {
      :tag => -1,
      :map_id => [145,146,147,148,149,659,809,1083,1084,1085,1175,1176,1232,1267,1268,1279,1514,1910,1932,1933,1934,1935,
      ],
    },
    :洞窟 => {
      :tag => -1,
      :map_id => [17,18,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,150,155,156,157,158,160,161,163,165,166,175,192,198,204,
         210,214,231,232,233,234,236,239,241,243,245,247,258,259,261,263,265,266,267,283,284,285,286,287,288,289,290,328,330,364,365,366,367,368,398,399,400,401,402,403,
         444,447,448,449,454,475,643,647,656,657,658,664,699,700,704,795,796,798,799,801,805,806,807,808,812,821,822,
         1150,1151,1152,1155,1210,1242,1243,1244,1245,1246,1247,1248,1249,1255,1256,1257,1258,1259,1260,1261,1262,1332,1357,1358,1359,
         1576,1582,1584,1590,1591,1593,1594,1599,1602,1610,1611,1613,1626,1628,1629,1630,1633,1645,1716,1717,1718,1719,1720,1721,1724,1725,1726,1727,1732,1733,1735,1737,1746,1747,1748,1931,
      ],
    },
    :市街 => {
      :tag => -1,
      :map_id => [
         23,29,33,45,46,55,56,164,176,177,185,219,225,226,279,280,338,359,360,361,362,363,378,387,388,389,483,484,513,515,616,624,667,679,680,681,682,683,684,686,
        687,688,689,690,691,692,693,694,695,697,698,719,720,721,722,723,742,762,763,764,765,766,768,770,771,776,777,778,779,783,785,789,815,829,
        1003,1004,1007,1008,1009,1022,1023,1026,1027,1030,1031,1032,1038,1043,1044,1045,1046,1049,1058,1059,1060,1061,1062,1063,1071,1086,1087,1088,1097,1098,1099,1100,1101,
        1102,1103,1104,1106,1109,1112,1115,1116,1118,1127,1128,1129,1156,1157,1158,1159,1160,1161,1163,1164,1199,1200,1250,1251,1252,1253,1254,1263,1264,1265,1266,1269,1270,1271,1371,1372,1373,1374,
        1449,1450,1453,1465,1469,1475,1482,1497,1503,1516,1517,1519,1532,1538,1570,1572,1597,1617,1618,1634,1635,1636,1637,1644,1646,1647,1648,1649,1653,1662,1667,1670,1671,1680,1685,1691,1696,
        1701,1708,1710,1711,1765,1807,1855,1867,1868,1869,1872,1873,1875,1877,1879,1884,1895,1904,1907,1916,1917,1918,1919,1921,1925,1977,1978,1980,
      ],
    },
  }   
end

# 視界制限　設定項目
module TMBLSIGHT
  # 何番のマップをどれだけ視界制限するか
  # 例）SIGHT[3] = 128  # ３番のマップの視界を128ドット四方に制限する
  SIGHT = {}
  SIGHT[94] = 350
  SIGHT[234] = 350
  SIGHT[236] = 350
  SIGHT[265] = 350
  SIGHT[258] = 350
  SIGHT[259] = 350
  SIGHT[261] = 350
  SIGHT[263] = 350
  SIGHT[239] = 350
  SIGHT[175] = 350
  SIGHT[241] = 350
  SIGHT[243] = 350
  SIGHT[245] = 350
  SIGHT[247] = 350
  SIGHT[1610] = 350
  SIGHT[1611] = 350
  SIGHT[1732] = 350
  SIGHT[1733] = 350
  SIGHT[1735] = 350
  SIGHT[1737] = 350

  VN_SIGHT = 2    # 視界のサイズ補正に利用するゲーム変数番号
end

